Autodesk.Revit.Creation.AreaCreationData.TagPoint
Specify the location of the area tag.

Autodesk.Revit.Creation.AreaCreationData.#ctor(Autodesk.Revit.DB.ViewPlan,Autodesk.Revit.DB.UV)
The data needed to create a new area
areaView: The view of area element.
point: The point which lies in the enclosed region of AreaBoundaryLines to put the new created Area

Autodesk.Revit.Creation.AreaCreationData
A class which wraps the arguments of Area for batch creation